ajustes nos scripts e documentacao
